#+NAME: APISnoop WebUI
#+AUTHOR: Zach Mandeville
#+EMAIL: zz@ii.coop
#+PROPERTY: :dir ~/Projects/ii/apisnoop_webui
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(i) | DONE(d) DONE-AND-SHARED(!)

*** Testing everything
    :PROPERTIES:
    :header-args: :dir ~/Projects/ii/apisnoop_webui/backend :results output verbatim drawer
    :END:

    With yr tests configured you can run them all in the terminal.
    #+NAME: test everything
    #+BEGIN_SRC shell
      yarn test
    #+END_SRC

    #+RESULTS: test everything
    :RESULTS:
    :END:

*** dependencies
   We want to add some adaptors for react to use redux //and// feathers //and// tachyons
   #+NAME: install dependencies
   #+BEGIN_SRC sh :results output verbatim drawer
     npm install --save \
         @feathersjs/client \
         feathers-localstorage \
         feathers-redux \
         react-dom \
         react-redux \
         react-router \
         react-router-redux \
         react-router-dom \
         redux \
         redux-thunk \
         redux-devtools-extension \
         redux-saga \
         superagent
   #+END_SRC

   #+RESULTS: install dependencies
   :RESULTS:
   + react-dom@16.5.2
   + react-router@4.3.1
   + feathers-localstorage@3.0.0
   + react-redux@5.0.7
   + redux@4.0.0
   + superagent@4.0.0-beta.5
   + redux-saga@0.16.0
   + react-router-redux@4.0.8
   + @feathersjs/client@3.7.3
   added 11 packages from 11 contributors, updated 5 packages and audited 14613 packages in 12.257s
   found 0 vulnerabilities

   :END:
*** file structure
    Within our client we want to manage our various components, the actions they can call upon, and the reducers that turn all these actions into a single state of the app. These dont' come with the basic react app, so we'll create them.
    We also want to delete any of the default react icons or CSS stuff and move our App.js into a component (cos that's what it is.
    #+BEGIN_SRC sh :results output
      cd src
      rm App.css index.css logo.svg
      mkdir components actions reducers sagas
      mv App.js components
      cd ..
      tree -I 'node_modules'
    #+END_SRC
    #+RESULTS:
    #+begin_example
    .
    ├── README.md
    ├── package-lock.json
    ├── package.json
    ├── public
    │   ├── favicon.ico
    │   ├── index.html
    │   └── manifest.json
    ├── src
    │   ├── App.test.js
    │   ├── actions
    │   ├── components
    │   │   └── App.js
    │   ├── index.js
    │   ├── reducers
    │   ├── registerServiceWorker.js
    │   └── sagas
    └── yarn.lock

    5 directories, 11 files
    #+end_example
*** Install Tachyons and Sheetify
    I wont' be using sheetify right now, but the goal is to use it upon a refactor (when we've moved away from webpack to browseriy)
    #+NAME: Install Tachyons
    #+BEGIN_SRC shell :dir ~/Projects/ii/apisnoop_webui/client :results output verbatim drawer
      npm install --save tachyons tachyons-cli sheetify
    #+END_SRC

    #+RESULTS: Install Tachyons
    :RESULTS:
    + tachyons-cli@1.3.2
    + tachyons@4.11.1
    + sheetify@7.3.3
    added 31 packages from 18 contributors, updated 2 packages, moved 3 packages and audited 20856 packages in 29.843s
    found 1 low severity vulnerability
      run `npm audit fix` to fix them, or `npm audit` for details
    :END:
*** Find Home for CSS
    #+NAME: Find Home for CSS
    #+BEGIN_SRC shell :dir ~/Projects/ii/apisnoop_webui/client/src :results output verbatim drawer
      mkdir css
      echo '@import "tachyons"' > css/app.css
      tree css
    #+END_SRC

    #+RESULTS: Find Home for CSS
    :RESULTS:
    css
    └── app.css

    0 directories, 1 file
    :END:
